In [1]:
from utils.query_db import db_connection

How many payment transactions were greater than $5.00?

In [2]:
with db_connection() as conn:
    conn.fetch_all("""SELECT COUNT(payment_id)
                      FROM payment
                      WHERE amount > 5;""")

   count
0   3618

How many actors have a first name that starts with the letter P?

In [3]:
with db_connection() as conn:
    conn.fetch_all("""SELECT COUNT(first_name)
                      FROM actor 
                      WHERE first_name LIKE 'P%';""")

   count
0      5

How many unique districts are our customers from?

In [4]:
with db_connection() as conn:
    conn.fetch_all("""SELECT COUNT(DISTINCT(district))
                      FROM address;""")

   count
0    378

Retrieve the list of names for those distinct districts from the previous question.

In [5]:
with db_connection() as conn:
    conn.fetch_all("""SELECT DISTINCT(district)
                      FROM address;""")

            district
0               Aden
1    Eastern Visayas
2              Vaduz
3              Tokat
4          Anzotegui
..               ...
373   Rostov-na-Donu
374             Sind
375          Nghe An
376           Ktahya
377         Veracruz

[378 rows x 1 columns]

How many films have a rating of R and a replacement cost between $5 and $15?

In [6]:
with db_connection() as conn:
    conn.fetch_all("""SELECT COUNT(title)
                      FROM film
                      WHERE rating = 'R'
                                AND
                            replacement_cost BETWEEN 5 AND 15;""")

   count
0     52

How many films have the word Truman somewhere in the title?

In [7]:
with db_connection() as conn:
    conn.fetch_all("""SELECT COUNT(title)
                      FROM film
                      WHERE title LIKE '%Truman%';""")

   count
0      5